tap "homebrew/services"
brew "glib"
brew "cmake"
brew "fribidi"
brew "harfbuzz"
brew "libsodium"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "gemini-cli"
brew "gibo"
brew "libgit2"
brew "git-delta"
brew "go"
brew "icu4c@76"
brew "python@3.12"
brew "libomp"
brew "imagemagick"
brew "mpich"
brew "protobuf"
brew "mysql@5.7", restart_service: :changed
brew "neovim"
brew "nodebrew"
brew "pkgconf"
brew "postgresql@14", restart_service: :changed
brew "pyenv"
brew "r"
brew "rbenv"
brew "tmux"
cask "alt-tab"
cask "db-browser-for-sqlite"
cask "dbeaver-community"
cask "font-hack-nerd-font"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "jordanbaird-ice"
cask "karabiner-elements"
# cask "mactex-no-gui"
vscode "anthropic.claude-code"
vscode "castwide.solargraph"
vscode "cschlosser.doxdocgen"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
# vscode "james-yu.latex-workshop"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "janisdd.vscode-edit-csv"
vscode "jeff-hykin.better-cpp-syntax"
vscode "misogi.ruby-rubocop"
vscode "mosapride.zenkaku"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "pkief.material-icon-theme"
vscode "reditorsupport.r"
vscode "reditorsupport.r-syntax"
vscode "ritwickdey.liveserver"
vscode "saoudrizwan.claude-dev"
vscode "shardulm94.trailing-spaces"
vscode "shopify.ruby-lsp"
vscode "streetsidesoftware.code-spell-checker"
vscode "twxs.cmake"
